/* automatically generated by rust-bindgen, manually modified */

/// Use, if no supported device is connected
pub const NK_device_model_NK_DISCONNECTED: NK_device_model = 0;
/// Nitrokey Pro.
pub const NK_device_model_NK_PRO: NK_device_model = 1;
/// Nitrokey Storage.
pub const NK_device_model_NK_STORAGE: NK_device_model = 2;
/// The Nitrokey device models supported by the API.
pub type NK_device_model = u32;
/// Stores the status of a Storage device.
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NK_storage_status {
    /// Indicates whether the unencrypted volume is read-only.
    pub unencrypted_volume_read_only: bool,
    /// Indicates whether the unencrypted volume is active.
    pub unencrypted_volume_active: bool,
    /// Indicates whether the encrypted volume is read-only.
    pub encrypted_volume_read_only: bool,
    /// Indicates whether the encrypted volume is active.
    pub encrypted_volume_active: bool,
    /// Indicates whether the hidden volume is read-only.
    pub hidden_volume_read_only: bool,
    /// Indicates whether the hidden volume is active.
    pub hidden_volume_active: bool,
    /// The major firmware version, e. g. 0 in v0.40.
    pub firmware_version_major: u8,
    /// The minor firmware version, e. g. 40 in v0.40.
    pub firmware_version_minor: u8,
    /// Indicates whether the firmware is locked.
    pub firmware_locked: bool,
    /// The serial number of the SD card in the Storage stick.
    pub serial_number_sd_card: u32,
    /// The serial number of the smart card in the Storage stick.
    pub serial_number_smart_card: u32,
    /// The number of remaining login attempts for the user PIN.
    pub user_retry_count: u8,
    /// The number of remaining login attempts for the admin PIN.
    pub admin_retry_count: u8,
    /// Indicates whether a new SD card was found.
    pub new_sd_card_found: bool,
    /// Indicates whether the SD card is filled with random characters.
    pub filled_with_random: bool,
    /// Indicates whether the stick has been initialized by generating
    /// the AES keys.
    pub stick_initialized: bool,
}
#[test]
fn bindgen_test_layout_NK_storage_status() {
    assert_eq!(
        ::std::mem::size_of::<NK_storage_status>(),
        28usize,
        concat!("Size of: ", stringify!(NK_storage_status))
    );
    assert_eq!(
        ::std::mem::align_of::<NK_storage_status>(),
        4usize,
        concat!("Alignment of ", stringify!(NK_storage_status))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<NK_storage_status>())).unencrypted_volume_read_only as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NK_storage_status),
            "::",
            stringify!(unencrypted_volume_read_only)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<NK_storage_status>())).unencrypted_volume_active as *const _
                as usize
        },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(NK_storage_status),
            "::",
            stringify!(unencrypted_volume_active)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<NK_storage_status>())).encrypted_volume_read_only as *const _
                as usize
        },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(NK_storage_status),
            "::",
            stringify!(encrypted_volume_read_only)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<NK_storage_status>())).encrypted_volume_active as *const _
                as usize
        },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(NK_storage_status),
            "::",
            stringify!(encrypted_volume_active)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<NK_storage_status>())).hidden_volume_read_only as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(NK_storage_status),
            "::",
            stringify!(hidden_volume_read_only)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<NK_storage_status>())).hidden_volume_active as *const _ as usize
        },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(NK_storage_status),
            "::",
            stringify!(hidden_volume_active)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<NK_storage_status>())).firmware_version_major as *const _
                as usize
        },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(NK_storage_status),
            "::",
            stringify!(firmware_version_major)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<NK_storage_status>())).firmware_version_minor as *const _
                as usize
        },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(NK_storage_status),
            "::",
            stringify!(firmware_version_minor)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<NK_storage_status>())).firmware_locked as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(NK_storage_status),
            "::",
            stringify!(firmware_locked)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<NK_storage_status>())).serial_number_sd_card as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(NK_storage_status),
            "::",
            stringify!(serial_number_sd_card)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<NK_storage_status>())).serial_number_smart_card as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(NK_storage_status),
            "::",
            stringify!(serial_number_smart_card)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<NK_storage_status>())).user_retry_count as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(NK_storage_status),
            "::",
            stringify!(user_retry_count)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<NK_storage_status>())).admin_retry_count as *const _ as usize
        },
        21usize,
        concat!(
            "Offset of field: ",
            stringify!(NK_storage_status),
            "::",
            stringify!(admin_retry_count)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<NK_storage_status>())).new_sd_card_found as *const _ as usize
        },
        22usize,
        concat!(
            "Offset of field: ",
            stringify!(NK_storage_status),
            "::",
            stringify!(new_sd_card_found)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<NK_storage_status>())).filled_with_random as *const _ as usize
        },
        23usize,
        concat!(
            "Offset of field: ",
            stringify!(NK_storage_status),
            "::",
            stringify!(filled_with_random)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<NK_storage_status>())).stick_initialized as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(NK_storage_status),
            "::",
            stringify!(stick_initialized)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NK_storage_ProductionTest {
    pub FirmwareVersion_au8: [u8; 2usize],
    pub FirmwareVersionInternal_u8: u8,
    pub SD_Card_Size_u8: u8,
    pub CPU_CardID_u32: u32,
    pub SmartCardID_u32: u32,
    pub SD_CardID_u32: u32,
    pub SC_UserPwRetryCount: u8,
    pub SC_AdminPwRetryCount: u8,
    pub SD_Card_ManufacturingYear_u8: u8,
    pub SD_Card_ManufacturingMonth_u8: u8,
    pub SD_Card_OEM_u16: u16,
    pub SD_WriteSpeed_u16: u16,
    pub SD_Card_Manufacturer_u8: u8,
}
#[test]
fn bindgen_test_layout_NK_storage_ProductionTest() {
    assert_eq!(
        ::std::mem::size_of::<NK_storage_ProductionTest>(),
        28usize,
        concat!("Size of: ", stringify!(NK_storage_ProductionTest))
    );
    assert_eq!(
        ::std::mem::align_of::<NK_storage_ProductionTest>(),
        4usize,
        concat!("Alignment of ", stringify!(NK_storage_ProductionTest))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<NK_storage_ProductionTest>())).FirmwareVersion_au8 as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NK_storage_ProductionTest),
            "::",
            stringify!(FirmwareVersion_au8)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<NK_storage_ProductionTest>())).FirmwareVersionInternal_u8
                as *const _ as usize
        },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(NK_storage_ProductionTest),
            "::",
            stringify!(FirmwareVersionInternal_u8)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<NK_storage_ProductionTest>())).SD_Card_Size_u8 as *const _
                as usize
        },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(NK_storage_ProductionTest),
            "::",
            stringify!(SD_Card_Size_u8)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<NK_storage_ProductionTest>())).CPU_CardID_u32 as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(NK_storage_ProductionTest),
            "::",
            stringify!(CPU_CardID_u32)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<NK_storage_ProductionTest>())).SmartCardID_u32 as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(NK_storage_ProductionTest),
            "::",
            stringify!(SmartCardID_u32)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<NK_storage_ProductionTest>())).SD_CardID_u32 as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(NK_storage_ProductionTest),
            "::",
            stringify!(SD_CardID_u32)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<NK_storage_ProductionTest>())).SC_UserPwRetryCount as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(NK_storage_ProductionTest),
            "::",
            stringify!(SC_UserPwRetryCount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<NK_storage_ProductionTest>())).SC_AdminPwRetryCount as *const _
                as usize
        },
        17usize,
        concat!(
            "Offset of field: ",
            stringify!(NK_storage_ProductionTest),
            "::",
            stringify!(SC_AdminPwRetryCount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<NK_storage_ProductionTest>())).SD_Card_ManufacturingYear_u8
                as *const _ as usize
        },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(NK_storage_ProductionTest),
            "::",
            stringify!(SD_Card_ManufacturingYear_u8)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<NK_storage_ProductionTest>())).SD_Card_ManufacturingMonth_u8
                as *const _ as usize
        },
        19usize,
        concat!(
            "Offset of field: ",
            stringify!(NK_storage_ProductionTest),
            "::",
            stringify!(SD_Card_ManufacturingMonth_u8)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<NK_storage_ProductionTest>())).SD_Card_OEM_u16 as *const _
                as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(NK_storage_ProductionTest),
            "::",
            stringify!(SD_Card_OEM_u16)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<NK_storage_ProductionTest>())).SD_WriteSpeed_u16 as *const _
                as usize
        },
        22usize,
        concat!(
            "Offset of field: ",
            stringify!(NK_storage_ProductionTest),
            "::",
            stringify!(SD_WriteSpeed_u16)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<NK_storage_ProductionTest>())).SD_Card_Manufacturer_u8
                as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(NK_storage_ProductionTest),
            "::",
            stringify!(SD_Card_Manufacturer_u8)
        )
    );
}
extern "C" {
    pub fn NK_get_storage_production_info(
        out: *mut NK_storage_ProductionTest,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    /// Set debug level of messages written on stderr
    /// @param state state=True - most messages, state=False - only errors level
    pub fn NK_set_debug(state: bool);
}
extern "C" {
    /// Set debug level of messages written on stderr
    /// @param level (int) 0-lowest verbosity, 5-highest verbosity
    pub fn NK_set_debug_level(level: ::std::os::raw::c_int);
}
extern "C" {
    /// Get the major library version, e. g. the 3 in v3.2.
    /// @return the major library version
    pub fn NK_get_major_library_version() -> ::std::os::raw::c_uint;
}
extern "C" {
    /// Get the minor library version, e. g. the 2 in v3.2.
    /// @return the minor library version
